from requests import get
# ======================================================================================================================
# لیست درخواست‌ها به آدرس‌های مختلف برای دریافت قیمت‌ها
# ======================================================================================================================
lis = [
    get('https://www.tgju.org/profile/geram18'), # درخواست به صفحه قیمت طلا ۱۸ عیار
    get('https://www.tgju.org/profile/geram24'), # درخواست به صفحه قیمت طلا ۲۴ عیار
    get('https://www.tgju.org/profile/sekeb'),   # درخواست به صفحه قیمت سکه بهار آزادی
    get('https://www.tgju.org/profile/sekee'),   # درخواست به صفحه قیمت سکه امامی
    get('https://www.tgju.org/profile/nim'),     # درخواست به صفحه قیمت نیم سکه
    get('https://www.tgju.org/profile/rob'),     # درخواست به صفحه قیمت ربع سکه
    get('https://www.tgju.org/profile/price_dollar_rl'), # درخواست به صفحه قیمت دلار آمریکا
    get('https://www.tgju.org/profile/price_eur'),       # درخواست به صفحه قیمت یورو
    get('https://www.tgju.org/profile/price_gbp')        # درخواست به صفحه قیمت پوند بریتانیا
]
# ======================================================================================================================