import re
from bs4 import BeautifulSoup
# ======================================================================================================================
# تابعی برای قالب‌بندی و بازگرداندن اطلاعات طراحی شده
# ======================================================================================================================
def design(lst):
    return (f'''
💰طلا :

۱۸ عیار: {((lst[0][0])//10):,}
۲۴ عیار: {((lst[1][0])//10):,}

🪙سکه :

سکه بهار آزادی: {((lst[2][0])//10):,}
سکه امامی: {((lst[3][0])//10):,}
نیم سکه: {((lst[4][0])//10):,}
ربع سکه: {((lst[5][0])//10):,}

💵ارز :

دلار آمریکا: {((lst[6][0])//10):,}
یورو: {((lst[7][0])//10):,}
پوند بریتانیا: {((lst[8][0])//10):,}
''')
# ======================================================================================================================
# تابعی برای استخراج قیمت‌ها از درخواست وب و تبدیل آن‌ها به لیستی از اعداد
# ======================================================================================================================
def cost(request):
    f_list=[]
    soup=BeautifulSoup(request.text,'html.parser')
    price=soup.find(class_="value")
    sub=re.sub(',','',str(price))
    res=re.findall(r'\d+',sub)
    f_res=int(res[0])
    f_list.append(f_res)
    return f_list
# ======================================================================================================================